---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DefaultViewTemplate
source: html/87218915-ae57-9e8d-2e29-ddb94d74f1bb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DefaultViewTemplate Property

"View Template applied to new views"

## Syntax (C#)
```csharp
public static ForgeTypeId DefaultViewTemplate { get; }
```